# SQL training Notebook for programmer

* This Notebook provides a solid SQL training. It works based on a SQLite database. SQLite is a widely used database. As Android uses it and the web browsers also rely on it, the number of actively used instances goes into the billions.

* After running the initialization cell, one can work on the exercises in any order. All the solutions are independent of each other.

* You will get a description of the exercise you have to solve in an SQL statement. The solution cell - where you enter your answer - has the starting SQL statement, which you will modify / enrich to provide the solution.

* Each exercise contains the resulting table expected to be produced by your solution.

* This Notebook focuses on the SELECT SQL statement (DQL), as this is the most used one in a program:

## Initialization

Please run the cell below this one to initialize the notebook. After that, you are free to pick and choose the tasks you want to work on in any order.

In [2]:
%load_ext sql

%config SqlMagic.style = '_DEPRECATED_DEFAULT'

%sql sqlite:///dbs/orderdb.sqlite

print('Initialized')

Initialized

When you run the next cell, you should see this output:

<img src="pics/sql-db-table-list.png">

The PRAGMA command used is SQLite specific. This does not work with any other database.

**If this is not the case, then the database did not load correctly. The consequence of this is that you cannot run the following exercises.**

In [3]:
%sql PRAGMA table_list

 * sqlite:///dbs/orderdb.sqlite
Done.

[('main', 'Student', 'table', 3, 0, 0),
 ('main', 'Suppliers', 'table', 8, 0, 0),
 ('main', 'Products', 'table', 6, 0, 0),
 ('main', 'OrderItems', 'table', 5, 0, 0),
 ('main', 'Orders', 'table', 5, 0, 0),
 ('main', 'Customers', 'table', 6, 0, 0),
 ('main', 'sqlite_schema', 'table', 5, 0, 0),
 ('temp', 'sqlite_temp_schema', 'table', 5, 0, 0)]

And another verification:  The list of the tables in the db and the number of records contained in them. The result should look like this in order to assure working with the correct db:

<img src="pics/sql-db-num-records.png">

There is no need right now to understand the SELECT statement just now. It will become more clear along the exercises in this notebook. At the moment, just verify the results.

In [4]:
%%sql
SELECT 'Customers'  Tablename, COUNT(*) Number_of_Records FROM Customers 
UNION
SELECT 'Products'  , COUNT(*) FROM Products
UNION
SELECT 'Suppliers'  , COUNT(*) FROM Suppliers
UNION
SELECT 'Orders'  , COUNT(*) FROM Orders
UNION
SELECT 'OrderItems'  , COUNT(*) FROM OrderItems

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Customers', 91),
 ('OrderItems', 2155),
 ('Orders', 830),
 ('Products', 78),
 ('Suppliers', 31)]

## Database design

Here is the design of the SQLite database:

<img src="pics/db.png">

The yellow arrows show the Foreign-Key relationship between the tables.

## How to work with the Notebook

Each exercise in this Notebook describes a problem for you to solve with a SQL SELECT statement. Below the problem description, there is the result of the correct SQL statement. This answer is either provided in the form of a string, a number or a complete table (similar to the ones above). 

Below the exercise, there will be a cell for the answer. Often, there is a rudimentary SELECT statement in the cell already for you to expand on.

## SELECT statement
The SELECT statement allows retrieving data from a db based on the criteria provided with the SELECT. It is a very powerful command, which can process very complex criteria.

As you will see in the following exercises, the SELECT command allows to not only work based on one table, but it can provide results, which are a combination of the data of multiple tables. 

The structure of a SELECT statement looks like this:

SELECT <br>
FROM <br>
WHERE <br>
GROUP BY <br>
HAVING <br>
ORDER BY <br>
LIMIT <br>

The following exercises will introduce the different parts of the select statement to you. Each section is built like this: First, there is a short summary of the  part of the SELECT statement looked at, and then there will be exercises. Their difficulty / complexity will increase, starting with EASY, then MEDIUM, then HARD. There is no need to answer all the exercises in order to have a basic to good understanding of SQL. The idea simply is to challenge those students, who already have some SQL knowledge.

This Notebook provides the resulting tables based on the provided SQLite db. We will discuss the SQL statements to solve the exercises during the lecture.

As there are tables in the db with hundreds, if not thousands of entries, the exercises often ask you for the number of records found in the result set. That means, that you will have to provide the correct SQL statement and then have it count the number of found records in the dab. (How this counting is done will be covered further down.

The advantage of the approach is that the required SQL statement can be constructed, but the Notebook is not containing tables with hundreds of records.

Have fun!

### Select one-liners

The following exercises focus on only using the SELECT keyword and none of the other parts of the SELECT statement. This is rarely used in real life, but it demonstrates an aspect seldom shown.

The exercises show the following:

* Use literals
* Perform arithmetic
* Alias columns
* Use functions
* Nest expressions

DO NOT FORGET THE SEMICOLON AT THE END OF EACH SELECT STATEMENT!

#### Easy

##### Ex: A_001:

Simpler than this it will will not get. Select the number 5.

In [5]:
%%sql
Select 5;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(5,)]

Your answer:

In [6]:
%%sql
SELECT 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_002

Add 2 and 3

In [7]:
%%sql

Select 2 + 3;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(5,)]

Your answer:

In [8]:
%%sql
SELECT 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_003

Select the string 'Hello'

In [9]:
%%sql

SELECT 'Hello';

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Hello',)]

Your answer:

In [10]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_004

Add 2 and 3 as Sum:  The intension is to name the column Sum.

In [11]:
%%sql

SELECT 2 + 3 AS Sum;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(5,)]

Your answer:

In [12]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Medium

##### Ex: A_020

Have two columns, A and B. The value in column A is 10, in column B is 20.

In [13]:
%%sql

SELECT 10 AS A, 20 AS B;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(10, 20)]

Your answer:

In [14]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_021

Show the result of 10 / 3  --  with decimal points

In [15]:
%%sql

SELECT 10.0 / 3;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(3.3333333333333335,)]

Your answer:

In [16]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_022

Show the square root of 49

In [17]:
%%sql

SELECT sqrt( 49 );

 * sqlite:///dbs/orderdb.sqlite
Done.

[(7.0,)]

Your answer:

In [18]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_023

Show the current date

In [19]:
%%sql

SELECT date('now');

 * sqlite:///dbs/orderdb.sqlite
Done.

[('2025-04-13',)]

Your answer:

In [20]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_024

Concatenate the strings "Hello "  and  "World!"

In [21]:
%%sql

SELECT 'Hello ' || 'World!' as 'Concatenated strings'

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Hello World!',)]

Your answer:

In [22]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Hard

##### Ex: A_040

Round 10 divided by 3 to 2 decimals

In [23]:
%%sql

SELECT round(10.0 / 3, 2) as 'Rounded to 2 decimals';

 * sqlite:///dbs/orderdb.sqlite
Done.

[(3.33,)]

Your answer:

In [24]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_041

Uppercase the word 'hello'  --  This is important, as it often is used in comparisons when one is not sure of the upper / lower case spelling of the words compared.

In [25]:
%%sql

SELECT upper('hello') as 'All Big Caps';

 * sqlite:///dbs/orderdb.sqlite
Done.

[('HELLO',)]

Your answer:

In [26]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_042

Get the length of 'This is a very interesting bootcamp!'

In [27]:
%%sql

SELECT length( 'This is a very interesting bootcamp!' ) as 'String length';

 * sqlite:///dbs/orderdb.sqlite
Done.

[(36,)]

Your answer:

In [28]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_043

Get today's weekday  -  I run it on a Wednesday (Monday == 1).

In [29]:
%%sql

SELECT strftime('%w', 'now') 'Weekday';

 * sqlite:///dbs/orderdb.sqlite
Done.

[('0',)]

Your answer:

In [30]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: A_044

Create an expression: 2 * (5 + 3)

In [31]:
%%sql

SELECT 2 * (5 + 3) AS '(Nested) Expression';

 * sqlite:///dbs/orderdb.sqlite
Done.

[(16,)]

Your answer:

In [32]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

### From part (with use of LIMIT)

Starting here, the exercises are based on the database described above. 

FROM allows specifying the tables (and data sources) used in a Query. Based on this, the SELECT part defines the columns and calculations thereof, which are contained in the resultset. For the moment, the exercises deal with one table in the FROM part only. Here is a simple statement:

> Select City 
From   Suppliers;

Here we get all the values from the Suppliers table for the attribute City. 

Multiple columns (attributes) are separated by comma:

> Select CompanyName, City 
From   Suppliers;

If one wants all the columns (attributes) then the asterisk is used:

>  Select * 
From   Suppliers;

Depending on the content of the table the resultset can get very large very soon. In order to keep it large enough to see a result, but short enough to not overload this Notebook, all the SELECT statements here need to make use of the LIMIT clause, too.

The LIMIT clause - as the name implies - shows only a smaller set of records of the full resultset. Here is the same SELECT from above, only showing the first 10 entries:

> Select City 
From   Suppliers
Limit 10;

Pagination of the records in the resultset can be reached by specifying an offset:

> Select City 
From   Suppliers
Limit 10  Offset 20;

The SELECT shows the records 21 to 30 out of the resultset (if that many records exist).

#### Easy

##### Ex: B_001

Show the first 10 records of table Customers with all the attributes of the table.

In [33]:
%%sql

SELECT * FROM Customers Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1, 'Maria', 'Anders', 'Berlin', 'Germany', '030-0074321'),
 (2, 'Ana', 'Trujillo', 'México D.F.', 'Mexico', '(5) 555-4729'),
 (3, 'Antonio', 'Moreno', 'México D.F.', 'Mexico', '(5) 555-3932'),
 (4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788'),
 (5, 'Christina', 'Berglund', 'Luleå', 'Sweden', '0921-12 34 65'),
 (6, 'Hanna', 'Moos', 'Mannheim', 'Germany', '0621-08460'),
 (7, 'Frédérique', 'Citeaux', 'Strasbourg', 'France', '88.60.15.31'),
 (8, 'Martín', 'Sommer', 'Madrid', 'Spain', '(91) 555 22 82'),
 (9, 'Laurence', 'Lebihan', 'Marseille', 'France', '91.24.45.40'),
 (10, 'Elizabeth', 'Lincoln', 'Tsawassen', 'Canada', '(604) 555-4729')]

Your answer:

In [34]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: B_002

Show the 42nd to 53rd records of table Customers with all the attributes of the table.

In [35]:
%%sql

SELECT * FROM Customers Limit 12 Offset 41;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(42, 'Yoshi', 'Tannamuri', 'Vancouver', 'Canada', '(604) 555-3392'),
 (43, 'John', 'Steel', 'Walla Walla', 'USA', '(509) 555-7969'),
 (44, 'Renate', 'Messner', 'Frankfurt a.M.', 'Germany', '069-0245984'),
 (45, 'Jaime', 'Yorres', 'San Francisco', 'USA', '(415) 555-5938'),
 (46, 'Carlos', 'González', 'Barquisimeto', 'Venezuela', '(9) 331-6954'),
 (47, 'Felipe', 'Izquierdo', 'I. de Margarita', 'Venezuela', '(8) 34-56-12'),
 (48, 'Fran', 'Wilson', 'Portland', 'USA', '(503) 555-9573'),
 (49, 'Giovanni', 'Rovelli', 'Bergamo', 'Italy', '035-640230'),
 (50, 'Catherine', 'Dewey', 'Bruxelles', 'Belgium', '(02) 201 24 67'),
 (51, 'Jean', 'Fresnière', 'Montréal', 'Canada', '(514) 555-8054'),
 (52, 'Alexander', 'Feuer', 'Leipzig', 'Germany', '0342-023176'),
 (53, 'Simon', 'Crowther', 'London', 'UK', '(171) 555-7733')]

Your answer:

In [36]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

##### Ex: B_003

Show the city and country from Suppliers for the first 10 records.

In [37]:
%%sql

SELECT City, Country FROM Suppliers Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('London', 'UK'),
 ('New Orleans', 'USA'),
 ('Ann Arbor', 'USA'),
 ('Tokyo', 'Japan'),
 ('Oviedo', 'Spain'),
 ('Osaka', 'Japan'),
 ('Melbourne', 'Australia'),
 ('Manchester', 'UK'),
 ('Göteborg', 'Sweden'),
 ('Sao Paulo', 'Brazil')]

Your answer:

In [38]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Medium

##### Ex: B_020

Select first and last name as a full name from Customers for the first 10 records.

In [39]:
%%sql

SELECT FirstName || ' ' || Lastname as 'Full name' From Customers Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Maria Anders',),
 ('Ana Trujillo',),
 ('Antonio Moreno',),
 ('Thomas Hardy',),
 ('Christina Berglund',),
 ('Hanna Moos',),
 ('Frédérique Citeaux',),
 ('Martín Sommer',),
 ('Laurence Lebihan',),
 ('Elizabeth Lincoln',)]

Your answer:

In [40]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Hard

##### Ex: B_040

Show name and unit price plus 19% (MWSt) from Products for the first 10 products.

In [41]:
%%sql

SELECT ProductName, UnitPrice * 1.19 AS PriceWithTax FROM Products Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Chai', 21.419999999999998),
 ('Chang', 22.61),
 ('Aniseed Syrup', 11.899999999999999),
 ("Chef Anton's Cajun Seasoning", 26.18),
 ("Chef Anton's Gumbo Mix", 25.4065),
 ("Grandma's Boysenberry Spread", 29.75),
 ("Uncle Bob's Organic Dried Pears", 35.699999999999996),
 ('Northwoods Cranberry Sauce', 47.599999999999994),
 ('Mishi Kobe Niku', 115.42999999999999),
 ('Ikura', 36.89)]

Your answer:

In [42]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

### WHERE clause

The WHERE clause provides the mechanism to pass the parameters into the SQL statement, which are applied to filter the data in the tables. Multiple criteria can be combined with the AND / OR operator. Parentheses "()" allow for grouping of criteria.

Here is a very simple example:

> Select Lastname 
From Customers 
Where City = "San Francisco";

and here with two criteria:

> Select Lastname 
From Customers 
Where City = "London"
And Firstname = "Ann";

Numerical comparison is similar to the comparisons found in programming languages. For string comparison, there is next to the equal sign the LIKE operator. LIKE allows the use of wildcards. The "_" (underscore) represent one and exactly one character, while "%" (percent sigh) for zero or more characters. 

> Select Lastname 
From Customers 
Where City Like "L_nd_n"
And Firstname Like "%nn";

#### Easy

#### Ex.: C_001

Show all customers from Germany

In [43]:
%%sql

SELECT * FROM Customers WHERE Country = 'Germany';

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1, 'Maria', 'Anders', 'Berlin', 'Germany', '030-0074321'),
 (6, 'Hanna', 'Moos', 'Mannheim', 'Germany', '0621-08460'),
 (17, 'Sven', 'Ottlieb', 'Aachen', 'Germany', '0241-039123'),
 (25, 'Peter', 'Franken', 'München', 'Germany', '089-0877310'),
 (39, 'Philip', 'Cramer', 'Brandenburg', 'Germany', '0555-09876'),
 (44, 'Renate', 'Messner', 'Frankfurt a.M.', 'Germany', '069-0245984'),
 (52, 'Alexander', 'Feuer', 'Leipzig', 'Germany', '0342-023176'),
 (56, 'Henriette', 'Pfalzheim', 'Köln', 'Germany', '0221-0644327'),
 (63, 'Horst', 'Kloss', 'Cunewalde', 'Germany', '0372-035188'),
 (79, 'Karin', 'Josephs', 'Münster', 'Germany', '0251-031259'),
 (86, 'Rita', 'Müller', 'Stuttgart', 'Germany', '0711-020361')]

Your answer:

In [44]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: C_002

Show all products with a price less than 20 Dollars

In [45]:
%%sql

SELECT * FROM Products WHERE UnitPrice < 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(13, 'Konbu', 6, 6.0, '2 kg box', 0),
 (19, 'Teatime Chocolate Biscuits', 8, 9.2, '10 boxes x 12 pieces', 0),
 (23, 'Tunnbröd', 9, 9.0, '12 - 250 g pkgs.', 0),
 (24, 'Guaraná Fantástica', 10, 4.5, '12 - 355 ml cans', 1),
 (33, 'Geitost', 15, 2.5, '500 g', 0),
 (41, "Jack's New England Clam Chowder", 19, 9.65, '12 - 12 oz cans', 0),
 (45, 'Rogede sild', 21, 9.5, '1k pkg.', 0),
 (47, 'Zaanse koeken', 22, 9.5, '10 - 4 oz boxes', 0),
 (52, 'Filo Mix', 24, 7.0, '16 - 2 kg boxes', 0),
 (54, 'Tourtière', 25, 7.45, '16 pies', 0),
 (75, 'Rhönbräu Klosterbier', 12, 7.75, '24 - 0.5 l bottles', 0),
 (78, 'Stroopwafels', 22, 9.75, '24 pieces', 0)]

Your answer:

In [46]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Medium

#### Ex.: C_020

Show all customers from Austria and Spain

In [47]:
%%sql

SELECT * FROM Customers WHERE Country in ('Austria', 'Spain');

 * sqlite:///dbs/orderdb.sqlite
Done.

[(8, 'Martín', 'Sommer', 'Madrid', 'Spain', '(91) 555 22 82'),
 (20, 'Roland', 'Mendel', 'Graz', 'Austria', '7675-3425'),
 (22, 'Diego', 'Roel', 'Madrid', 'Spain', '(91) 555 94 44'),
 (29, 'Eduardo', 'Saavedra', 'Barcelona', 'Spain', '(93) 203 4560'),
 (30, 'José', 'Pedro Freyre', 'Sevilla', 'Spain', '(95) 555 82 82'),
 (59, 'Georg', 'Pipps', 'Salzburg', 'Austria', '6562-9722'),
 (69, 'Alejandra', 'Camino', 'Madrid', 'Spain', '(91) 745 6200')]

Your answer:

In [48]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: C_021

Show all Suppliers out of a city starting with the letter P

In [49]:
%%sql

SELECT * from Suppliers where city like 'P%'

 * sqlite:///dbs/orderdb.sqlite
Done.

[(18, 'Aux joyeux ecclésiastiques', 'Guylène Nodier', None, 'Paris', 'France', '(1) 03.83.00.68', '(1) 03.83.00.62')]

Your answer:

In [50]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: C_022

Show all products having a price between 31 and 40 Dollars

In [51]:
%%sql

SELECT ProductName, UnitPrice FROM Products WHERE UnitPrice BETWEEN 31 AND 40;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Northwoods Cranberry Sauce', 40.0),
 ('Ikura', 31.0),
 ('Queso Manchego La Pastora', 38.0),
 ('Alice Mutton', 39.0),
 ('Gumbär Gummibärchen', 31.23),
 ('Mascarpone Fabioli', 32.0),
 ('Perth Pasties', 32.8),
 ('Gnocchi di nonna Alice', 38.0),
 ('Camembert Pierrot', 34.0),
 ('Wimmers gute Semmelknödel', 33.25),
 ('Gudbrandsdalsost', 36.0),
 ('Mozzarella di Giovanni', 34.8)]

Your answer:

In [52]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Hard

#### Ex.: C_040

Show all Customers with a lastname ending in 'n'  and which are not located in Germany

In [53]:
%%sql

SELECT * FROM Customers WHERE Country <> 'Germany' And Lastname Like '%n';

 * sqlite:///dbs/orderdb.sqlite
Done.

[(9, 'Laurence', 'Lebihan', 'Marseille', 'France', '91.24.45.40'),
 (10, 'Elizabeth', 'Lincoln', 'Tsawassen', 'Canada', '(604) 555-4729'),
 (12, 'Patricio', 'Simpson', 'Buenos Aires', 'Argentina', '(1) 135-5555'),
 (16, 'Elizabeth', 'Brown', 'London', 'UK', '(171) 555-2282'),
 (19, 'Ann', 'Devon', 'London', 'UK', '(171) 555-0297'),
 (24, 'Maria', 'Larsson', 'Bräcke', 'Sweden', '0695-34 67 21'),
 (48, 'Fran', 'Wilson', 'Portland', 'USA', '(503) 555-9573'),
 (65, 'Paula', 'Wilson', 'Albuquerque', 'USA', '(505) 555-5939'),
 (70, 'Jonas', 'Bergulfsen', 'Stavern', 'Norway', '07-98 92 35'),
 (73, 'Jytte', 'Petersen', 'Kobenhavn', 'Denmark', '31 12 34 56'),
 (76, 'Pascale', 'Cartrain', 'Charleroi', 'Belgium', '(071) 23 67 22 20'),
 (77, 'Liz', 'Nixon', 'Portland', 'USA', '(503) 555-3612'),
 (83, 'Palle', 'Ibsen', 'Århus', 'Denmark', '86 21 32 43'),
 (90, 'Matti', 'Karttunen', 'Helsinki', 'Finland', '90-224 8858')]

Your answer:

In [54]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

### Group by clause (including Having)

The Group by clause groups the records in a result set according to one or more attributes. These groups can be processed by aggregate functions: Min, Max, Avg, Sum.

The following Select statement shows the number of customers per country:

> SELECT Country, COUNT(*) FROM Customers GROUP BY Country;

The Having clause is used in combination with a Group by clause and provides filter criteria for an aggregate function.


#### Easy

#### Ex.: D_001

Show the number of products, which are discontinued as well as the number of products, which are not discontinued. (0 -> False,  1 -> True)

In [55]:
%%sql

SELECT IsDiscontinued, count(*)  FROM Products GROUP BY IsDiscontinued;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(0, 70), (1, 8)]

Your answer:

In [56]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: D_002

Show the number of suppliers per city for the first 10 cities.

In [57]:
%%sql

SELECT City, count(*) FROM Suppliers GROUP BY City Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Ann Arbor', 1),
 ('Annecy', 1),
 ('Bend', 1),
 ('Berlin', 1),
 ('Boston', 1),
 ('Cuxhaven', 1),
 ('Dallas', 1),
 ('Frankfurt', 1),
 ('Göteborg', 1),
 ('Lappeenranta', 1)]

Your answer:

In [58]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Medium

#### Ex.: D_020

Provide the average price per supplier (over all their products) for the first 10 records

In [59]:
%%sql

SELECT SupplierId, AVG(UnitPrice) FROM Products GROUP BY SupplierId Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1, 15.666666666666666),
 (2, 20.35),
 (3, 31.666666666666668),
 (4, 46.0),
 (5, 29.5),
 (6, 14.916666666666666),
 (7, 35.57),
 (8, 28.175),
 (9, 15.0),
 (10, 4.5)]

Your answer:

In [60]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: D_021

Provide the total number of items per Orderid for the first 10 entries

In [61]:
%%sql

SELECT OrderId, SUM(Quantity) FROM OrderItems GROUP BY OrderId Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1, 27),
 (2, 49),
 (3, 60),
 (4, 41),
 (5, 105),
 (6, 102),
 (7, 57),
 (8, 110),
 (9, 27),
 (10, 46)]

Your answer:

In [62]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Hard

#### Ex.: D_040

List all customers with the number of their orders as long as they have more than 2 orders (again, the first 10 records)

In [63]:
%%sql

SELECT CustomerId, COUNT(*) AS OrderCount FROM Orders GROUP BY CustomerId HAVING COUNT(*) > 2 Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1, 6),
 (2, 4),
 (3, 7),
 (4, 13),
 (5, 18),
 (6, 7),
 (7, 11),
 (8, 3),
 (9, 17),
 (10, 14)]

Your answer:

In [64]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: D_041

Show all Suppliers (ID), the kind of package they use and the number of different products they use the package for as long as the same package is used for multiple products of that supplier.

In [65]:
%%sql

SELECT SupplierId, Package, COUNT(*) FROM Products GROUP BY Supplierid, Package having Count(*) > 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(14, '24 - 200 g pkgs.', 2),
 (16, '24 - 12 oz bottles', 3),
 (26, '24 - 250 g pkgs.', 2)]

Your answer:

In [66]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

### Order by clause

The order by clause allows for sorting of the resultset. Its usage is straight forward: Order by <attribute1> <Asc / Desc> [<attribute> <Asc / Desc>] ...

The  attribute is the column used for sorting and Asc / Desc determines if the result set is ordered for that attribute in ASCending or DESCending order.

> Select ID, TotalAmount from Orders 
where ID < 10
Order by TotalAmount DESC;

#### Ex.: E_010

Show all products ordered, descending by price as long as the price is between 80 and 300 Dollars.

In [67]:
%%sql

SELECT ProductName, UnitPrice FROM Products where unitprice between 80 and 300 ORDER BY UnitPrice DESC;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Côte de Blaye', 263.5),
 ('Thüringer Rostbratwurst', 123.79),
 ('Mishi Kobe Niku', 97.0),
 ("Sir Rodney's Marmalade", 81.0)]

Your answer:

In [68]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: E_011

Show all products ordered ascending by price as long as the price is between 80 and 300 Dollars.

In [69]:
%%sql

SELECT ProductName, UnitPrice FROM Products where unitprice between 80 and 300 ORDER BY UnitPrice Asc;

 * sqlite:///dbs/orderdb.sqlite
Done.

[("Sir Rodney's Marmalade", 81.0),
 ('Mishi Kobe Niku', 97.0),
 ('Thüringer Rostbratwurst', 123.79),
 ('Côte de Blaye', 263.5)]

Your answer:

In [70]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

### Joins

Joining is needed when there are 2 or more tables used in a Select statement. There are 4 types of Joins:

1. (Inner) Join
2. Left (Outer) Join
3. Right (Outer) Join
4. Full (Outer) Join

Here are these Joins visualized:

<img src="pics/joins.png">

So far, all exercises only worked with a single table. That lead to the situation, that we only were able to provide IDs instead of say a Supplier anme, as Customer name and so on. 

Joins allow combining the information contained in multiple tables and with that provide all the information needed.

This example not only get the product name from the Products table, but also the Supplier name for that product from the Supplier table:

>  SELECT Suppliers.CompanyName AS SupplierName, ProductName, Suppliers.id, Products.supplierid
FROM Products JOIN Suppliers ON Products.SupplierId = Suppliers.Id 
Limit 10;

How does this inner join conceptually work?

1. Create the Cartesian Product of the two tables (Each record of table Products is combined with every record of table Suppliers).  Say we have 12 Products records and 7 Suppliers records then the Cartesian Product contains a set of 7 * 12 combined records ( = 84).

2. Eliminate all the records, that do not satisfy the criteria : Products.SupplierId = Suppliers.Id 

3. If the Select contained a Where clause or Group by and Having then these would be processed, too.

4. If there is a Order by clause, then the records are ordered accordingly.

5. Lastly, if existent, the Limit clause is processed.


More generally expressed, this is the order in which the different parts of a Select Statement are processed :

1. From part (including the JOINs)

2. Where clause

3. Group by

4. Having

5. Order by

6. Limit

7. Select

Please consider these questions:

- Is this order the only one? Could certain steps be swapped?

-  What is the advice you would give to someone working with Select statement? What should they consider / take care of? When?

#### Easy

#### Ex.: F_001

Show the Customers (by name) and their order numbers. Sort by last name and limit the list to the first 7 records.

In [71]:
%%sql

SELECT Customers.FirstName, Customers.LastName, Orders.OrderNumber
From Customers INNER JOIN Orders ON Customers.Id = Orders.CustomerId
Order by Customers.LastName
Limit 7;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Paolo', 'Accorti', '542552'),
 ('Paolo', 'Accorti', '542840'),
 ('Paolo', 'Accorti', '542883'),
 ('Paolo', 'Accorti', '542937'),
 ('Paolo', 'Accorti', '543156'),
 ('Paolo', 'Accorti', '543190'),
 ('Pedro', 'Afonso', '542420')]

Your answer:

In [72]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: F_002

List the Products (by name) and their suppliers (by name). Order the list by product name and limit it to the first 10 entries.

In [73]:
%%sql

SELECT ProductName, CompanyName
FROM Products
INNER JOIN Suppliers ON Products.SupplierId = Suppliers.Id
order by ProductName
Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Alice Mutton', 'Pavlova, Ltd.'),
 ('Aniseed Syrup', 'Exotic Liquids'),
 ('Boston Crab Meat', 'New England Seafood Cannery'),
 ('Camembert Pierrot', 'Gai pâturage'),
 ('Carnarvon Tigers', 'Pavlova, Ltd.'),
 ('Chai', 'Exotic Liquids'),
 ('Chang', 'Exotic Liquids'),
 ('Chartreuse verte', 'Aux joyeux ecclésiastiques'),
 ("Chef Anton's Cajun Seasoning", 'New Orleans Cajun Delights'),
 ("Chef Anton's Gumbo Mix", 'New Orleans Cajun Delights')]

Your answer:

In [74]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: F_003

Show the Customers (by name) and the number of orders they have placed, as long as they have more than 15 orders with us. Order the list by the last name of the customer.

In [75]:
%%sql

SELECT Customers.FirstName, Customers.LastName, count(*)
From Customers INNER JOIN Orders ON Customers.Id = Orders.CustomerId
Group by Customers.FirstName, Customers.LastName
Having count(*) > 15
Order by Customers.LastName;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Christina', 'Berglund', 18),
 ('Carlos', 'Hernández', 18),
 ('Horst', 'Kloss', 28),
 ('Maria', 'Larsson', 19),
 ('Laurence', 'Lebihan', 17),
 ('Patricia', 'McKenna', 19),
 ('Roland', 'Mendel', 30),
 ('Jose', 'Pavarotti', 31),
 ('Paula', 'Wilson', 18)]

Your answer:

In [76]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Medium

#### Ex.: F_020

List the product names and the number of orders they appear in. Limit the list to the first 10 entries. Order the list by product name.

In [77]:
%%sql

SELECT Products.ProductName, count(*)		
FROM OrderItems			
INNER JOIN Products ON OrderItems.ProductId = Products.Id			
INNER JOIN Orders ON OrderItems.OrderId = Orders.Id
Group by Products.ProductName
order by ProductName
Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Alice Mutton', 37),
 ('Aniseed Syrup', 12),
 ('Boston Crab Meat', 41),
 ('Camembert Pierrot', 51),
 ('Carnarvon Tigers', 27),
 ('Chai', 38),
 ('Chang', 44),
 ('Chartreuse verte', 30),
 ("Chef Anton's Cajun Seasoning", 20),
 ("Chef Anton's Gumbo Mix", 10)]

Your answer:

In [78]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: F_021

List the Order number, their total amount and the last name of the customer. Order the list by total amount (From high to low) and limit to the first 8 entries;

In [79]:
%%sql

SELECT Orders.OrderNumber, Orders.TotalAmount, Customers.LastName			
FROM Orders			
JOIN Customers ON Orders.CustomerId = Customers.Id
order by Orders.TotalAmount Desc
Limit 8;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('542995', 17250.0, 'Kloss'),
 ('543160', 16321.9, 'Pavarotti'),
 ('543111', 15810.0, 'Pontes'),
 ('542502', 12281.2, 'Carvalho'),
 ('542554', 11493.2, 'Fresnière'),
 ('542947', 11490.7, 'Cramer'),
 ('543019', 11380.0, 'Wilson'),
 ('542547', 11283.2, 'Petersen')]

Your answer:

In [80]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Ex.: F_022

Show the customer's first name and the products they have ordered (one line per product). Order the list by product name.

In [81]:
%%sql

SELECT Customers.FirstName, Products.ProductName			
FROM Customers			
INNER JOIN Orders ON Customers.Id = Orders.CustomerId			
INNER JOIN OrderItems ON Orders.Id = OrderItems.OrderId			
INNER JOIN Products ON OrderItems.ProductId = Products.Id
Order by Productname
Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Frédérique', 'Alice Mutton'),
 ('Renate', 'Alice Mutton'),
 ('Paula', 'Alice Mutton'),
 ('Pascale', 'Alice Mutton'),
 ('Miguel', 'Alice Mutton'),
 ('Rene', 'Alice Mutton'),
 ('Jean', 'Alice Mutton'),
 ('Paula', 'Alice Mutton'),
 ('Yoshi', 'Alice Mutton'),
 ('Roland', 'Alice Mutton')]

Your answer:

In [82]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

#### Hard

#### Ex.: F_040

Provide a list with all products, their suppliers and the customers, who ordered them. Limit the list to 10 entries.

In [83]:
%%sql

SELECT Products.ProductName, Suppliers.CompanyName, Customers.LastName			
FROM OrderItems			
JOIN Products ON OrderItems.ProductId = Products.Id			
JOIN Suppliers ON Products.SupplierId = Suppliers.Id			
JOIN Orders ON OrderItems.OrderId = Orders.Id			
JOIN Customers ON Orders.CustomerId = Customers.Id
Limit 10;

 * sqlite:///dbs/orderdb.sqlite
Done.

[('Queso Cabrales', "Cooperativa de Quesos 'Las Cabras'", 'Henriot'),
 ('Singaporean Hokkien Fried Mee', 'Leka Trading', 'Henriot'),
 ('Mozzarella di Giovanni', 'Formaggi Fortini s.r.l.', 'Henriot'),
 ('Tofu', "Mayumi's", 'Josephs'),
 ('Manjimup Dried Apples', "G'day, Mate", 'Josephs'),
 ("Jack's New England Clam Chowder", 'New England Seafood Cannery', 'Pontes'),
 ('Manjimup Dried Apples', "G'day, Mate", 'Pontes'),
 ('Louisiana Fiery Hot Pepper Sauce', 'New Orleans Cajun Delights', 'Pontes'),
 ("Gustaf's Knäckebröd", 'PB Knäckebröd AB', 'Saveley'),
 ('Ravioli Angelo', 'Pasta Buttini s.r.l.', 'Saveley')]

Your answer:

In [84]:
%%sql

Select 1;

 * sqlite:///dbs/orderdb.sqlite
Done.

[(1,)]

### Special topic:  Correlated subrequests / subqueries

A correlated subrequest is a query inside of another query, which references an attribute of the outer query. In consequence, the correlated subselect is executed once for every record (row) of the outer query.

The following Select statement with a subselect finds all customers, who have placed at least one order:

> SELECT FirstName, LastName 
FROM Customers C
WHERE EXISTS (
    SELECT 1 
    FROM Orders O 
    WHERE O.CustomerId = C.Id
);

Such subselects can be nested over multiple levels. But this Notebook does not go into this.

Such subselects can usually be written differently without the subselects. Which version to use depends on a number of criteria, the most dominant being the performance of the query. 

This table contains 3 different ways to achieve the same result as the correlated subselect above:


| Original:<br />Correlated Subselect | Alternative 1<br />Join + Distinct | Alternative 2<br />In operator | Alternative 3<br />Inner Join with Group by |
| ----------------------------- | - | - | - |
| SELECT FirstName, LastName<br />FROM Customers C<br />WHERE EXISTS (<br />    SELECT 1<br />    FROM Orders O<br />    WHERE O.CustomerId = C.Id<br />); | SELECT DISTINCT Customers.FirstName, Customers.LastName<br />FROM Customers<br />JOIN Orders ON Customers.Id = Orders.CustomerId; | SELECT FirstName, LastName <br />FROM Customers <br />WHERE Id IN (SELECT CustomerId FROM Orders); | SELECT Customers.FirstName, Customers.LastName<br />FROM Customers<br />JOIN Orders ON Customers.Id = Orders.CustomerId<br />GROUP BY Customers.Id |

Each DBMS provides tools, which calculate the "cost" of a query, trying to express, how performant it is in terms of cpu and memory utilization.

### Special topic: Transactions

A transaction is a group of one or more SQL statements that are executed as a single unit. The goal is to ensure that either all operations succeed together, or none of them take effect at all.

Think of a transaction like a bank transfer:

1. You want to withdraw money from Account A and deposit it into Account B.
2. If only one of those steps succeeds, something's gone wrong — the system must roll back both steps.

A transaction follows the ACID principles:

| Property | Description | 
| -------- | ----------- | 
| Atomicity   | All operations succeed or none at all.                                 | 
| Consistency | The database moves from one valid state to another.                    | 
| Isolation	  | Concurrent transactions don’t interfere with each other.               | 
| Durability  | Once committed, the transaction stays committed—even after power loss. | 

The table below shows the basic transaction commands:

| Command | Explanation | 
| ------- | ------------ | 
| <Nothing> | Depending on the setting of Autocommit in the DB any statement after the end of a transaction starts a new transaction. | 
| Begin; <br /> Begin Transaction; | Start of a transaction | 
| Commit;                          | Saves changes permanently | 
| Rollback;                        | Undo all changes since the BEGIN | 
| --------------------------       | | 
| Savepoint #name;                 | Defines a point within a transaction to go back to when needed. | 
| Rollback to #name;               | Go back to Savepoint #name | 
| Release Savepoint #name          | Free resources while transaction is still running | 

*Example:*

> BEGIN;<br /><br />
UPDATE Products SET UnitPrice = UnitPrice * 0.9;<br /><br />
SAVEPOINT before_delete;<br />
DELETE FROM Products WHERE UnitPrice < 1;<br /><br />
-- Oops! Too much<br />
ROLLBACK TO before_delete;<br /><br />
-- Changes before the Savepoint are kept<br /><br />
COMMIT;

### Special topic:  Null values

In SQL, NULL means "unknown", "missing", or "not applicable" — it does not mean zero, empty string, or false. Almost any attributes can contain NUll as a value. 

There are attributes, which cannot be NULL. One of them is the primary key of a table (which values need to be unique also). All other attributes might have a constraint put on them while creating the database (NOT NULL). A foreign key, on the other hand, can be null, even multiple records can have a null value as foreign key. This simply means, that there is no entry in the table the foreign key points to, which is linked with the record in question.

#### Testing for Null

Comparing for Null is different from any other comparison. One cannot make use of the equal (=) sign. Instead, one uses the operator IS NULL or testing for not Null with IS NOT NULL.

> SELECT * FROM Customers WHERE Phone IS NULL;

One should notice, that greater than ( > NULL) or less than ( < NULL) also do not work.

#### Using COALESCE() to replace Null

Coalesce replaces Null values with a provided value. It returns any other value unaltered.

> SELECT FirstName, COALESCE(Phone, 'No phone') AS Contact
FROM Customers;

#### Aggregation & NULL

Aggregate functions ignore NULL values.

> Select count(*) from Suppliers;

This returns 31 records counted.

> Select count(Fax) from Suppliers;

This returns only 15 entries, as 16 are Null, as can be seen in this query:


> Select count(*) from Suppliers where Fax is NULL;